brianwyld/ble_nrf52_v2/src/main.c
    //todo remove uart disabled at 10s of ibeaconning for power
    /*                    
    app_timer_create(&m_deinit_uart_delay,
                        APP_TIMER_MODE_SINGLE_SHOT,
                        deinit_uart_timeout_handler);    
        uint32_t deinit_delay = APP_TIMER_TICKS(10000, APP_TIMER_PRESCALER);//32 * 10000;          
        app_timer_start(m_deinit_uart_delay, deinit_delay, NULL);
    */

   log_info("waiting for commands");
    for (;;)
    {        
        if (_ctx.resetRequested)
        {
            NVIC_SystemReset();
        }
        // Check if flash needs updating
        cfg_writeCheck();
        
        // Go in lowpower only if flash isn't busy
        if(!app_isFlashBusy())
        {
            power_manage();
        }
    }
}
#endif
#if 0
static void uart_event_handler(app_uart_evt_t * p_event)
{    
    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
        {
            // Read all the bytes we can 
            uint8_t c;
            while(app_uart_get(&c)==NRF_SUCCESS) 
            {
                app_uart_put(&c);
            }
            break;
        }

        case APP_UART_COMMUNICATION_ERROR:
            // This is for errors such as parity, framing, overrun or break (all 0 on the line)
            // None of these are fatal we can ignore them
//            APP_ERROR_HANDLER(p_event->data.error_communication);
        break;
 
        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
        break;
        
        case APP_UART_TX_EMPTY:
            break;
 
        default:
            break;
    }
}

// UARTs config
static app_uart_comm_params_t _uart_comm_params =
    {
        .rx_pin_no = 16, // RX_PIN_NUMBER A
        .tx_pin_no = 15, // TX_PIN_NUMBER A
        .rts_pin_no = -1,
        .cts_pin_no = -1,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity = false,
        .baud_rate = UART_BAUDRATE_BAUDRATE_Baud115200,
    };
int uart_tx(char* line) {
    int len = strlen(line);
    for(int i=0;i<len;i++) {
        // nrf uart api only allows one uart, sorry
        if (app_uart_put((uint8_t)(line[i]))!=NRF_SUCCESS) {
            return (len-i);       // Number of bytes not txd
        }
    }
    return 0;
}
int main(void)
{
    system_init();

    uint32_t  err_code=0;
    APP_UART_FIFO_INIT( (&_uart_comm_params),
                       64,
                       64,
                       uart_event_handler,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);

    // Tell host we are ready to rock
    uart_tx("READY\r\n");
    for (;;)
    {        
//        power_manage();
        uart_tx("*");
    }
}
#endif